{"meeting_code":"2026-02-18_-_north_york_community_counci_10","title":"2026-02-18 - North York Community Council - Meeting number 30","date":"Unknown date","source_url":"https://secure.toronto.ca/council/report.do?meeting=2026.NY30&type=minutes","motions":[{"id":1,"title":"North York Council Approves Zoning Amendment for Saguenay Avenue and Otter Crescent","summary":"The North York Community Council adopted a decision report to approve a zoning by-law amendment for properties located at 1, 3, 5, and 7 Saguenay Avenue, and 59R Otter Crescent. This decision changes the zoning regulations for these specific addresses.","status":"PASSED","category":"governance","impact_tags":["zoning change","North York","property development","urban planning"],"full_text":"NY30.1 - 1, 3, 5 and 7 Saguenay Avenue, and 59R Otter Crescent - Zoning By-law Amendment - Decision Report - Approval"},{"id":2,"title":"Zoning By-law Amendment for Saguenay Avenue and Otter Crescent","summary":"City Council approved an amendment to Zoning By-law 569-2013 for properties on Saguenay Avenue and Otter Crescent, allowing for specific land use changes as outlined in the draft amendment.","status":"PASSED","category":"governance","impact_tags":["zoning by-law","land use planning","North York","property development"],"full_text":"City Council amend City of Toronto Zoning By-law 569-2013 for the lands municipally known as 1, 3, 5 and 7 Saguenay Avenue, and 59R Otter Crescent, substantially in accordance with the draft Zoning By-law Amendment included as Attachment 5 to the report (January 30, 2026) from the Director, Community Planning, North York District. 2. City Council authorize the City Solicitor to make such stylistic and technical changes to the draft Zoning By-law Amendment as may be required."},{"id":3,"title":"Zoning By-law Amendment Approved for 250 Ferrand Drive","summary":"City Council approved a zoning by-law amendment for the property at 250 Ferrand Drive, allowing for changes to the land use or development rules at this location.","status":"PASSED","category":"governance","impact_tags":["zoning change","land use","development","Ferrand Drive"],"full_text":"NY30.2 - 250 Ferrand Drive - Zoning By-law Amendment - Decision Report - Approval"},{"id":4,"title":"City Council amends zoning for 250 Ferrand Drive","summary":"City Council adopted a recommendation to change Zoning By-law 569-2013 for the property at 250 Ferrand Drive, aligning it with a proposed amendment from the Director of Community Planning.","status":"ADOPTED","category":"governance","impact_tags":["zoning amendment","urban planning","development regulation","250 Ferrand Drive"],"full_text":"Amendment to Zoning By-law 569-2013 for 250 Ferrand Drive"},{"id":5,"title":"City Solicitor authorized for technical zoning by-law changes","summary":"Council authorized the City Solicitor to make any necessary stylistic or technical adjustments to the draft Zoning By-law Amendment.","status":"ADOPTED","category":"governance","impact_tags":["legal authority","by-law implementation","technical adjustments"],"full_text":"Authorize City Solicitor for technical changes to Zoning By-law Amendment"},{"id":6,"title":"Approval of Rental Housing Demolition Application at 7 and 11 Rochefort Drive","summary":"City Council approved the application for the demolition of rental housing units located at 7 and 11 Rochefort Drive.","status":"PASSED","category":"housing","impact_tags":["rental housing","demolition","development","Rochefort Drive"],"full_text":"NY30.3 - 7 and 11 Rochefort Drive - Rental Housing Demolition Application"},{"id":7,"title":"Approval of Rental Housing Demolition at 7 and 11 Rochefort Drive","summary":"City Council approved the demolition of 128 existing rental dwelling units at 7 and 11 Rochefort Drive, as recommended by the North York Community Council, subject to specific conditions.","status":"PASSED","category":"housing","impact_tags":["rental housing","demolition","North York","housing development"],"full_text":"City Council approve the Rental Housing Demolition application File Number 21 239145 NNY 15 RH in accordance with Chapter 667 of the Toronto Municipal Code and pursuant to Section 111 of the City of Toronto Act, 2006 to permit the demolition of 128 existing rental dwelling units located at 7 and 11 Rochefort Drive, subject to the following conditions:"},{"id":8,"title":"Mandatory Provision and Maintenance of 128 Replacement Rental Dwelling Units","summary":"City Council has mandated that a property owner must provide and maintain 128 two-bedroom replacement rental units, totaling at least 8,645 square metres, for a minimum of 20 years. During this period, these units cannot be converted to condominiums or other non-rental uses, nor can they be demolished without replacement.","status":"PASSED","category":"housing","impact_tags":["rental housing","housing development","tenant protection","long-term affordability","city planning"],"full_text":"The owner shall provide and maintain 128 replacement rental dwelling units on the subject site for a period of at least 20 years beginning from the date that each replacement rental dwelling unit is first occupied and, during which time, no application may be submitted to the City for condominium registration, or for any other conversion to a non-rental housing purpose, or for demolition without providing for replacement; b. The replacement rental dwelling units required by Recommendation 1.a. above shall collectively have a total gross floor area of at least 8,645 square metres and be comprised of 128 two-bedroom units, as generally illustrated in the plans submitted to City Planning dated May 26, 2025. Any revision to these plans shall be to the satisfaction of the Chief Planner and Executive Director, City Planning; c. The owner shall, as part of the 128 replacement rental dwelling units required in Recommendation 1."},{"id":9,"title":"Conditions for Replacement Rental Units and Tenant Assistance","summary":"Council has set conditions for a development, requiring the owner to provide 114 two-bedroom affordable rental units and 14 two-bedroom mid-range rental units for at least 10 years. The owner must also create a Tenant Assistance Plan for existing tenants and ensure new tenants have access to building amenities.","status":"PASSED","category":"housing","impact_tags":["affordable housing","rental housing","tenant protection","development conditions","housing affordability"],"full_text":"a above, provide at least 114 two-bedroom units replacement rental dwelling units at affordable rents, defined as gross monthly rent no greater than one times the average City of Toronto rent by unit type, as reported annually by the Canada Mortgage and Housing Corporation and 14 two-bedroom units at mid-range rents, defined as gross monthly rent that exceeds Affordable Rent but is no greater than 1.5 times the average City of Toronto rent by unit type, all for a period of at least 10 years beginning from the date of first occupancy of each unit. d. The owner shall provide a Tenant Assistance Plan for tenants of the 128 existing rental dwelling units proposed to be demolished to the satisfaction of the Chief Planner and Executive Director, City Planning; e. The owner shall provide tenants of all 128 replacement rental dwelling units with access to, and use of, all indoor and outdoor amenities in the proposed 30-storey building (Tower C) at no extra charge."},{"id":10,"title":"Conditions for Replacement Rental Units and Section 111 Agreement","summary":"Council has set conditions for a development, requiring the owner to provide tenants of replacement rental units with bicycle and visitor parking. These units must be ready for occupancy by the time 70% of the first phase (and any second phase) new units are ready. These conditions will be secured through a Section 111 agreement registered on the property title.","status":"PASSED","category":"housing","impact_tags":["rental housing","tenant parking","development conditions","Section 111 agreement","urban planning"],"full_text":"The owner shall provide tenants of all replacement rental dwelling units with access to bicycle and visitor parking on the same terms and conditions as any other resident of the proposed development; i. The replacement rental dwelling units required in Recommendation 1.a. above shall be made ready and available for occupancy no later than the date by which 70 percent of the new dwelling units in the first phase of the proposed development (exclusive of the replacement rental dwelling units) and any units in the second phase of the proposed development are made available and ready for occupancy, subject to any revisions to the satisfaction of the Chief Planner and Executive Director, City Planning; j. The owner shall enter into, and register on title to the lands, an agreement pursuant to Section 111 of the City of Toronto Act, 2006 to secure the conditions outlined in Recommendations 1.a. through 1.i."},{"id":11,"title":"Authorize Demolition Permit for 128 Rental Units at Rochefort Drive","summary":"City Council is considering authorizing the Chief Planner to issue a preliminary permit for the demolition of 128 existing rental dwelling units at 7 and 11 Rochefort Drive. This authorization is contingent on prior conditions being met and zoning by-law amendments being in effect.","status":"PASSED","category":"housing","impact_tags":["rental housing demolition","housing development","zoning by-law","city planning","Rochefort Drive"],"full_text":"2. City Council authorize the Chief Planner and Executive Director, City Planning, to issue Preliminary Approval of the Rental Housing Demolition Permit under Chapter 667 of the Toronto Municipal Code pursuant to Section 111 of the City of Toronto Act, 2006 for the demolition of the 128 existing rental dwelling units located at 7 and 11 Rochefort Drive after all the following have occurred: a. All conditions in Recommendation 1 above have been fully secured; b. The Zoning By-law Amendments for application 21 239141 NNY 15 OZ have come into full force and effect; c."},{"id":12,"title":"Authorization for Tower C Development Permits and Rental Demolition","summary":"City Council is authorizing the issuance of site plan approval conditions, excavation and shoring permits for Tower C, and a rental housing demolition permit, provided existing rental units are vacant and preliminary approval is granted.","status":"NULL","category":"housing","impact_tags":["Tower C development","site plan approval","rental housing demolition","building permits","urban planning"],"full_text":"The issuance of the Notice of Approval Conditions for site plan approval of Tower C by the Executive Director, Development Review or their designate, pursuant to Section 114 of the City of Toronto Act, 2006, or as otherwise determined by the Chief Planner and Executive Director, City Planning; d. The issuance of excavation and shoring permits (conditional or full permit) for the approved development on the site; and e. The owner has confirmed, in writing, that all existing rental dwelling units proposed to be demolished are vacant. 3. City Council authorize the Chief Building Official and Executive Director, Toronto Building to issue a Rental Housing Demolition Permit under Chapter 667 of the Toronto Municipal Code after the Chief Planner and Executive Director, City Planning, or their designate, has given Preliminary Approval referred to in Recommendation 2 above. 4."},{"id":13,"title":"Authorize Residential Demolition Permit for 7 and 11 Rochefort Drive","summary":"City Council is asked to allow the Chief Building Official to issue a permit for the demolition of residential buildings at 7 and 11 Rochefort Drive. This permit is conditional on the Chief Planner's preliminary approval and requires the owner to clear debris and erect hoarding after demolition.","status":"PASSED","category":"governance","impact_tags":["residential demolition","building permits","planning act","Rochefort Drive"],"full_text":"City Council authorize the Chief Building Official and Executive Director, Toronto Building to issue a Residential Demolition Permit under Section 33 of the Planning Act and Chapter 363 of the Toronto Municipal Code for 7 and 11 Rochefort Drive after the Chief Planner and Executive Director, City Planning has given Preliminary Approval referred to in Recommendation 2 above, which may be included in the Rental Housing Demolition Permit under Chapter 667 pursuant to section 6.2 of Chapter 363, on condition that: a. The owner removes all debris and rubble from the site immediately after demolition; b. The owner erects solid construction hoarding to the satisfaction of the Chief Building Official and Executive Director, Toronto Building; c."},{"id":14,"title":"Development Completion Timeline and Financial Penalties","summary":"This motion sets a three-year deadline for a developer to complete new buildings (Towers B and C) after demolishing existing rental units. If the developer fails to meet this deadline, the City Clerk can impose a $20,000 penalty per demolished dwelling unit, which will be added to property taxes as a lien.","status":"PASSED","category":"housing","impact_tags":["development timelines","rental unit replacement","developer accountability","financial penalties","urban planning"],"full_text":"The owner erects the proposed Phase 1 buildings (Towers B and C) on the site no later than three (3) years from the date that the demolition of the existing rental dwelling units commences, subject to the timeframe being extended at the discretion of the Chief Planner and Executive Director, City Planning; and d. Should the owner fail to complete the proposed building within the time specified in Recommendation 4.c. above, the City Clerk shall be entitled to enter on the collector’s roll, as with municipal property taxes, an amount equal to the sum of twenty thousand dollars ($20,000.00) per dwelling unit for which a demolition permit is issued, and that such amount shall, until payment, be a lien or charge upon the land for which the Residential Demolition Permit is issued."},{"id":15,"title":"Approval of Rental Housing Demolition and Replacement at 7 and 11 Rochefort Drive","summary":"City Council approved the demolition of two 4-storey apartment buildings containing 128 rental dwelling units at 7 and 11 Rochefort Drive, with the condition that all 128 rental units will be replaced as part of the new development on the site.","status":"PASSED","category":"housing","impact_tags":["rental housing","housing development","demolition","unit replacement","North York"],"full_text":"City Council authorize the appropriate City officials to take such actions as are necessary to implement City Council's decision, including execution of the Section 111 Agreement and any other related agreements."},{"id":16,"title":"Amendments to Official Plan and Zoning for 22-36 Greenbriar Road","summary":"City Council amended the Official Plan and Zoning By-law for the property at 22-36 Greenbriar Road in North York, following recommendations from the Community Planning Director. These changes modify existing planning regulations for the site.","status":"AMENDED","category":"governance","impact_tags":["zoning amendment","official plan","urban planning","North York development","planning regulations"],"full_text":"North York Community Council recommends that: 1. City Council amend Official Plan Amendment 650 (By-law Number 476-2023) for the lands municipally known as 22-36 Greenbriar Road substantially in accordance with the draft Official Plan Amendment included as Attachment 5 to the report (January 29, 2026) from the Director, Community Planning, North York District. 2. City Council amend Site-Specific Zoning By-law 478-2023 for the lands municipally known as 22-36 Greenbriar Road substantially in accordance with the draft Zoning By-law Amendment attached as Attachment 1 to the supplementary report (February 13, 2026) from the Director, Community Planning, North York District. 3. City Council determine that pursuant to Subsection 34(17) of the Planning Act, no further notice is required."},{"id":17,"title":"Approval of Official Plan and Zoning Amendments for 32-Storey Development at 22-36 Greenbriar Road","summary":"City Council approved amendments to the Official Plan and Zoning By-law to allow for a 32-storey building at 22-36 Greenbriar Road. Council also instructed the applicant to limit their appeal of the Renew Sheppard East Secondary Plan to only the lands at 22-36 Greenbriar Road.","status":"PASSED","category":"governance","impact_tags":["urban development","zoning changes","official plan","high-rise building","Greenbriar Road"],"full_text":"City Council authorizes the City Solicitor to make such stylistic and technical changes to the draft Official Plan Amendment and draft Zoning By-law Amendment, as may be required. City Council direct that before introducing the necessary bills to City Council for enactment, the applicant be required to: Scope its appeal of the Renew Sheppard East Secondary Plan (OPA 777) (By-law 1437-2024) geographically to the lands known municipally as 22-36 Greenbriar Road."},{"id":18,"title":"Fence Exemption Granted for 37 York Ridge Road","summary":"North York Community Council granted an exemption for a fence at 37 York Ridge Road, allowing the existing fence to remain provided it is maintained. Any future fence replacements must comply with the Municipal Code Chapter 447.","status":"AMENDED","category":"governance","impact_tags":["fence exemption","property by-law","municipal code","North York"],"full_text":"1. Granted the application for a fence exemption for the property owner of 37 York Ridge Road; directed and required that the enclosure be maintained in good repair without alteration; and at such time as replacement of the enclosure is required that such installation will comply with Municipal Code Chapter 447, Fences, or its successor by-law."},{"id":19,"title":"Assumption of Municipal Services for Plan of Subdivision 66M-2560","summary":"City Council decided to take over responsibility for municipal services, including public highways and street lighting, within Subdivision Plan 66M-2560. This also involves releasing the developer's performance guarantee and preparing a by-law for the assumption of public infrastructure.","status":"PASSED","category":"services","impact_tags":["subdivision development","municipal services","infrastructure","by-law enactment","developer agreements"],"full_text":"1. City Council assume the municipal services relating to Plan of Subdivision 66M-2560.2. City Council authorize the Director, Engineering Review, Development Review, to release the performance guarantee held with respect to the municipal services in accordance with the Subdivision Agreement, dated February 6, 2020 between IOTP Development Inc., and the City of Toronto.3. City Council authorize and direct the City Solicitor to prepare an assumption By-law to assume the public highway within Plan of Subdivision 66M-2560 and to bring it forward for enactment.4. City Council authorize the appropriate City Officials to transfer ownership of the street lighting system constructed within Plan of Subdivision 66M-2560 to Toronto Hydro Energy Services Inc."},{"id":20,"title":"North York Community Council Amends Residential Demolition Application","summary":"North York Community Council considered and amended a residential demolition application concerning properties located at 9, 11, 13 and 19 Steeles Avenue East and 8 and 10 Nipigon Avenue. The specific details of the amendment are not provided in the available text.","status":"AMENDED","category":"other","impact_tags":["demolition","residential properties","North York","planning decision"],"full_text":"Residential Demolition Application for 9, 11, 13 and 19 Steeles Avenue East and 8 and 10 Nipigon Avenue"},{"id":21,"title":"Approval for Demolition of Single-Family Homes on Steeles and Nipigon Avenues","summary":"North York Community Council approved the demolition of several single-family detached houses on Steeles Avenue East and Nipigon Avenue, subject to specific conditions for site management during and after demolition, including fencing, debris removal, site maintenance, and backfilling.","status":"PASSED","category":"governance","impact_tags":["demolition","residential property","urban planning","regulatory conditions","North York"],"full_text":"Approved the applications to demolish the single-family detached houses at 9, 11, 13 and 19 Steeles Avenue East and 8 and 10 Nipigon Avenue with the following conditions: a. That a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. That all debris and rubble be removed immediately after demolition; c. That sod be laid on the site and be maintained free of garbage and weeds, in accordance with the Municipal Code Chapter 629-10, paragraph B and 629-11; and d. That any holes on the property are backfilled with clean fill."},{"id":22,"title":"Demolition of four single-family homes on Hendon Avenue approved with conditions","summary":"North York Community Council approved the demolition of four single-family homes at 41, 43, 45, and 47 Hendon Avenue. The approval includes conditions such as erecting a construction fence, immediate debris removal, site maintenance with sod, and backfilling any holes with clean fill.","status":"PASSED","category":"housing","impact_tags":["demolition","single-family homes","building regulations","urban development","Willowdale"],"full_text":"Approved the applications to demolish the single-family dwellings at 41, 43, 45 and 47 Hendon Avenue with the following conditions: a. that a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. that all debris and rubble be removed immediately after demolition; c. that sod be laid on the site and be maintained free of garbage and weeds, in accordance with the Municipal Code Chapter 629-10, paragraph B and 629-11; and d. that any holes on the property are backfilled with clean fill."},{"id":23,"title":"Extension of Construction Staging Area on Cocksfield Avenue","summary":"North York Community Council approved an extension for the closure of a pedestrian sidewalk and a portion of the westbound curb lane on Cocksfield Avenue from March 1 to May 31, 2026, to facilitate a construction staging area. The council also directed the applicant to maintain a temporary pedestrian walkway.","status":"PASSED","category":"transportation","impact_tags":["construction","street closure","pedestrian safety","traffic management","North York"],"full_text":"1. Authorized the continuation of the closure of the pedestrian sidewalk and a 3.2 metre wide portion of the westbound curb lane on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and a point 105 metres further east, from March 1, 2026 to May 31, 2026, inclusive. 2. Continued to direct the applicant to install a temporary pedestrian walkway on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":24,"title":"Directives for Cocksfield Avenue Construction Staging Area Permit","summary":"City Council continued to issue directives to an applicant regarding a construction staging area permit on Cocksfield Avenue. These directives include maintaining a temporary walkway clear of snow and ice, ensuring Cocksfield Avenue and nearby driveways are free of snow accumulation, and providing traffic control persons at Cocksfield Avenue and Goddard Street to manage heavy truck movements and ensure safety.","status":"PASSED","category":"services","impact_tags":["construction impact","traffic management","pedestrian safety","winter maintenance","permit compliance"],"full_text":"Continued to direct the applicant to clean and maintain the proposed temporary walkway on the south side of Cocksfield Avenue in a condition clear of snow and ice, as required, through the winter months for the entire term of the construction staging area permit. Continued to direct the applicant to ensure that Cocksfield Avenue in the vicinity of the proposed construction staging area, as well as the residential driveways adjacent to the site, are maintained free of snow accumulation and snowbank sight-line obstructions during the winter months for the full term of the construction staging area permit. Continued to direct the applicant to provide designated Traffic Control Persons, at the intersection of Cocksfield Avenue and Goddard Street to escort heavy trucks to the construction staging area, while ensuring the safe and efficient truck movements to eliminate conflicts with general vehicular traffic and pedestrian movements."},{"id":25,"title":"Maintain 'No Stopping' on North Cocksfield Avenue","summary":"Council decided to keep the existing rule that prohibits stopping at any time on the north side of Cocksfield Avenue, specifically between 60 and 165 metres east of Wilmington Avenue.","status":"PASSED","category":"transportation","impact_tags":["traffic regulation","parking restriction","Cocksfield Avenue","road safety"],"full_text":"Continued to prohibit stopping at all times on the north side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and a point 105 metres further east."},{"id":26,"title":"Remove 'No Parking' on South Cocksfield Avenue","summary":"Council voted to remove the current 'no parking anytime' rule on the south side of Cocksfield Avenue, between 60 metres east of Wilmington Avenue and Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["parking regulation","traffic changes","Cocksfield Avenue","parking availability"],"full_text":"Rescinded the existing no parking anytime regulation on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":27,"title":"Maintain 'No Stopping' on South Cocksfield Avenue","summary":"Council decided to keep the existing rule that prohibits stopping at any time on the south side of Cocksfield Avenue, between 60 metres east of Wilmington Avenue and Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["traffic regulation","parking restriction","Cocksfield Avenue","road safety"],"full_text":"Continued to prohibit stopping at all times on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":28,"title":"Confirm Removal of One-Way Westbound Traffic on Cocksfield Avenue","summary":"Council confirmed the ongoing removal of the one-way westbound traffic rule on Cocksfield Avenue, specifically between Wilmington Avenue and 183 metres east of Wilmington Avenue.","status":"PASSED","category":"transportation","impact_tags":["traffic flow","road designation","Cocksfield Avenue","traffic changes"],"full_text":"Continued to rescind the existing one-way westbound traffic designation on Cocksfield Avenue, between Wilmington Avenue and a point 183 metres east of Wilmington Avenue."},{"id":29,"title":"Maintain One-Way Westbound Traffic on Cocksfield Avenue","summary":"Council decided to keep Cocksfield Avenue designated as one-way westbound traffic only, between Wilmington Avenue and Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["traffic flow","road designation","Cocksfield Avenue","traffic management"],"full_text":"Continued to designate Cocksfield Avenue, between Wilmington Avenue and Goddard Street as a one-way westbound traffic only."},{"id":30,"title":"Applicant cooperation for municipal infrastructure work","summary":"Council directed the applicant to fully cooperate with City staff on municipal infrastructure operations, maintenance, and construction near the staging area, and to remove staging at no cost to the City when needed for infrastructure work.","status":"PASSED","category":"services","impact_tags":["municipal infrastructure","construction management","city services","applicant responsibility"],"full_text":"Continued to direct the applicant to cooperate with and provide all necessary assistance to the City Engineers, staff and representatives carrying out operation, maintenance, and construction activities to municipal infrastructure within the vicinity of the construction staging area, and at no cost to the City to remove any staging to accommodate the necessary municipal infrastructure work."},{"id":31,"title":"Restoration of Cocksfield Avenue traffic and parking","summary":"Council directed that Cocksfield Avenue's traffic and parking regulations be restored to their pre-construction state once the project is finished, with updated parking rates and hours.","status":"PASSED","category":"transportation","impact_tags":["traffic regulations","parking","road restoration","Cocksfield Avenue"],"full_text":"Directed that Cocksfield Avenue be returned to its pre-construction traffic and parking regulations (except with parking rates and hours of operation being consistent to the rates and hours of operation at the time of completion) when the project is complete."},{"id":32,"title":"Council authorizes temporary road and sidewalk closure on Cocksfield Avenue","summary":"City Council approved a temporary closure of a pedestrian sidewalk and a portion of the westbound lane on Cocksfield Avenue from November 2025 to January 2026. This closure is to allow for staging operations related to the underground garage construction of a new residential building.","status":"PASSED","category":"transportation","impact_tags":["road closure","sidewalk closure","construction impact","traffic disruption","pedestrian access"],"full_text":"City Council at its meeting on October 8 and 9, 2025, adopted item - 2025.NY26.18 and in so doing authorized a closure of the pedestrian sidewalk and a 3.2 metre wide portion of the westbound lane on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street, from November 1, 2025 to January 31, 2026, to facilitate staging operations for the underground garage construction."},{"id":33,"title":"Request to Extend Cockfield Avenue Construction Staging Area","summary":"Transportation Services has requested an extension for the construction staging area on Cockfield Avenue by three months, from March 1 to May 31, 2026, to complete an underground garage. Pedestrian access will be maintained during this period.","status":"PASSED","category":"transportation","impact_tags":["street closure","construction","development","traffic management","pedestrian access"],"full_text":"Transportation Services is requesting authorization to extend the duration of the construction staging area on Cockfield Avenue for additional three months, from March 1, 2026 to May 31, 2026."},{"id":34,"title":"Approval for Speed Humps on Dalemount Avenue","summary":"The North York Community Council approved the installation of three speed humps on Dalemount Avenue, between Madoc Drive and Shelborne Avenue, to calm traffic and improve road safety.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","neighbourhood improvement"],"full_text":"1. Authorized the installation of traffic calming (3 speed humps) on Dalemount Avenue, between Madoc Drive and Shelborne Avenue, generally as shown in Attachment 2 to the report (January 30, 2026) from the Director, Enforcement and Street Management Transportation Services, Drawing Number TC-642, dated January 2026."},{"id":35,"title":"Dalemount Avenue - Traffic Calming (Speed Humps)","summary":"North York Community Council approved the installation of speed humps on Dalemount Avenue, between Madoc Drive and Shelborne Avenue, to calm traffic and improve safety, as the street met the criteria for traffic calming.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","neighbourhood improvement"],"full_text":"North York Community Council adopted the recommendation to install speed humps on Dalemount Avenue, between Madoc Drive and Shelborne Avenue."},{"id":36,"title":"Installation of Speed Humps on Ranleigh Avenue","summary":"City Council authorized the installation of two speed humps on Ranleigh Avenue to calm traffic between Mount Pleasant Road and Ronan Avenue, improving road safety.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","Ranleigh Avenue"],"full_text":"Authorized the installation of traffic calming (2 speed humps) on Ranleigh Avenue, between Mount Pleasant Road and Ronan Avenue, generally as shown in Attachment 2 to the report (January 30, 2026) from the Director, Enforcement and Street Management Transportation Services, Drawing Number TC-641, dated January 2026."},{"id":37,"title":"Designation of Fire Route at 20 O'Neill Road","summary":"North York Community Council approved the designation of specific private roads at 20 O'Neill Road as a fire route, ensuring clear access for emergency vehicles and enhancing fire safety.","status":"PASSED","category":"services","impact_tags":["fire safety","emergency access","property regulation","public safety"],"full_text":"1. Designated that part or those parts of the private road or roads shown on the site plans filed with the Fire Chief in respect of the municipal address set out below, as a fire route pursuant to Municipal Code Chapter 880 - Fire Routes - 20 O’Neill Road. 2. Authorized the Fire Chief and City Solicitor to take the appropriate action to make a designated Fire Route."},{"id":38,"title":"Moatfield Drive Traffic Calming (Speed Humps) Adopted","summary":"North York Community Council adopted a motion to implement traffic calming measures, specifically speed humps, on Moatfield Drive in Ward 16, Don Valley East, to enhance road safety and manage vehicle speeds.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","North York","Ward 16"],"full_text":"NY30.13 - Moatfield Drive - Traffic Calming (Speed Humps)"},{"id":39,"title":"Installation of Speed Humps and Speed Limit Reduction on Moatfield Drive","summary":"City Council authorized the installation of seven speed humps on Moatfield Drive, between Valleybrook Drive and Don Mills Road, to calm traffic. Additionally, the speed limit on this section of Moatfield Drive will be reduced from 40 km/h to 30 km/h once the speed humps are installed.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","speed limit reduction","road safety","Moatfield Drive"],"full_text":"1. Authorized the installation of traffic calming (7 speed humps) on Moatfield Drive, between Valleybrook Drive and Don Mills Road, generally as shown in Attachments 2 to 4 to the report (January 30, 2026) from the Director, Enforcement and Street Management Transportation Services, Drawing Number TC-647, TC-647-1 and TC-647-2, dated January 2026. 2. Subject to approval of Part 1 above, reduced the speed limit from 40 kilometres per hour to 30 kilometres per hour on Moatfield Drive, between Valleybrook Drive and Don Mills Road, in conjunction with the installation of speed humps."},{"id":40,"title":"Parking Restrictions Adopted for Dallimore Circle","summary":"City Council adopted a recommendation to prohibit standing on the south side of Dallimore Circle, Monday to Friday, within a specific section, to address changes to parking provisions and a community bus stop.","status":"ADOPTED","category":"transportation","impact_tags":["parking restrictions","traffic management","Dallimore Circle","community bus stop"],"full_text":"City Council prohibit standing, Monday to Friday, on the southside of Dallimore Circle, between a point 93 metres southwest of Haldenby Terrace (east intersection) and a point 21 metres further southwest."},{"id":41,"title":"Lowering Speed Limits in Parkwoods and Don Mills Neighbourhoods","summary":"The North York Community Council adopted a decision to reduce the speed limit from 50 km/h to 40 km/h on Bushbury Drive and Parmbelle Crescent in the Parkwoods and Don Mills neighbourhoods to enhance road safety.","status":"PASSED","category":"transportation","impact_tags":["speed limit reduction","road safety","North York","traffic calming"],"full_text":"Reduced the speed limit from 50 kilometres per hour to 40 kilometres per hour on the following roads: a. Bushbury Drive, between Laurentide Drive and the west end of Bushbury Drive; b. Parmbelle Crescent, between Bushbury Drive and Laurentide Drive;"},{"id":42,"title":"Changes to Parking By-laws on Upjohn Road","summary":"North York Community Council adopted a change to parking by-laws on Upjohn Road, amending a parking prohibition to allow more visitor parking, specifically to address access issues for visitors to the 33 Division Toronto Police Services station.","status":"PASSED","category":"transportation","impact_tags":["parking regulations","Upjohn Road","police station access","visitor parking"],"full_text":"Amended the parking prohibition in effect at all times on the east side of Upjohn Road, between York Mills Road and the south end of Upjohn Road, to be in effect between York Mills Road and Dyas Road."},{"id":43,"title":"Dunblaine Avenue Parking Rules Adopted","summary":"City Council approved new parking regulations for the section of Dunblaine Avenue west of Avenue Road, aiming to improve local traffic flow and parking availability.","status":"ADOPTED","category":"transportation","impact_tags":["parking","traffic","by-law","Dunblaine Avenue"],"full_text":"Parking Regulation Changes for Dunblaine Avenue, West of Avenue Road"},{"id":44,"title":"Dunblaine Avenue One-Hour Parking Regulation Amended","summary":"The existing one-hour parking limit on a section of Dunblaine Avenue was adjusted to apply to a different segment of the street, changing where drivers can park for up to an hour.","status":"AMENDED","category":"transportation","impact_tags":["parking regulations","Dunblaine Avenue","traffic management","local residents"],"full_text":"Amended the existing maximum one-hour parking regulation in effect from 8:30 a.m. to 6:00 p.m., Monday to Saturday, on the north side of Dunblaine Avenue, between Avenue Road and a point 77 metres west of Avenue Road, to be in effect between a point 36 metres west of Avenue Road to a point 41 metres further west."},{"id":45,"title":"Stopping Prohibited on Part of Dunblaine Avenue","summary":"Stopping is now forbidden at all times on a specific 17-meter stretch of Dunblaine Avenue, aiming to improve traffic flow and safety.","status":"PASSED","category":"transportation","impact_tags":["no stopping zone","Dunblaine Avenue","traffic safety","road access"],"full_text":"Prohibited stopping at all times on the north side of Dunblaine Avenue, between Avenue Road and a point 17 metres west."},{"id":46,"title":"New 15-Minute Parking Zone on Dunblaine Avenue","summary":"A new 15-minute parking limit was introduced daily on a specific 19-meter section of Dunblaine Avenue, allowing for short-term stops.","status":"PASSED","category":"transportation","impact_tags":["short-term parking","Dunblaine Avenue","local businesses","traffic flow"],"full_text":"Authorized parking for a maximum period of 15 minutes from 8:30 a.m. to 6:00 p.m., daily, on the north side of Dunblaine Avenue, between a point 17 metres west of Avenue Road and a point 19 metres further west."},{"id":47,"title":"North York Council Adopts Parking By-law for Dunblaine Avenue","summary":"North York Community Council adopted By-law 145-2026 to implement minor parking regulation changes on Dunblaine Avenue, west of Avenue Road. These changes were proposed after consultations with local businesses to support the Upper Avenue BIA.","status":"PASSED","category":"transportation","impact_tags":["parking regulations","local business support","North York","Dunblaine Avenue"],"full_text":"Minor parking regulation changes on Dunblaine Avenue, West of Avenue Road."},{"id":48,"title":"Approval of Zoning By-law Amendment for Saguenay Avenue and Otter Crescent","summary":"North York Community Council adopted a recommendation to approve a zoning by-law amendment for properties located at 1, 3, 5 and 7 Saguenay Avenue, and 59R Otter Crescent. This decision allows for changes to the land use regulations at these specific addresses.","status":"PASSED","category":"governance","impact_tags":["zoning amendment","urban planning","property development","North York"],"full_text":"NY30.1 - 1, 3, 5 and 7 Saguenay Avenue, and 59R Otter Crescent - Zoning By-law Amendment - Decision Report - Approval"},{"id":49,"title":"Zoning By-law Amendment for Saguenay Avenue and Otter Crescent","summary":"City Council approved an amendment to Zoning By-law 569-2013 for properties located at 1, 3, 5, 7 Saguenay Avenue and 59R Otter Crescent in North York. This decision allows for changes to the land use or development rules for these specific sites, with the City Solicitor authorized to make any necessary technical adjustments to the by-law.","status":"PASSED","category":"governance","impact_tags":["zoning amendment","land use planning","North York","property development"],"full_text":"City Council amend City of Toronto Zoning By-law 569-2013 for the lands municipally known as 1, 3, 5 and 7 Saguenay Avenue, and 59R Otter Crescent, substantially in accordance with the draft Zoning By-law Amendment included as Attachment 5 to the report (January 30, 2026) from the Director, Community Planning, North York District. 2. City Council authorize the City Solicitor to make such stylistic and technical changes to the draft Zoning By-law Amendment as may be required."},{"id":50,"title":"Zoning By-law Amendment Approved for 250 Ferrand Drive","summary":"City Council approved changes to the zoning by-law for the property at 250 Ferrand Drive, allowing for new development or land use in accordance with the proposed amendment.","status":"PASSED","category":"other","impact_tags":["zoning changes","land development","urban planning","North York"],"full_text":"City Council amend City of Toronto Zoning By-law 569-2013 for the lands municipally known as 250 Ferrand Drive substantially in accordance with the draft Zoning By-law Amendment included as Revised Attachment 5 to the report (January 30, 2026) from the Director, Community Planning, North York District. City Council authorize the City Solicitor to make such stylistic and technical changes to the draft Zoning By-law Amendment as may be required."},{"id":51,"title":"Zoning By-law Amendment Approved for 250 Ferrand Drive","summary":"City Council approved a zoning by-law amendment for the property at 250 Ferrand Drive in North York. This decision allows for the development of an underutilized site within a Major Transit Station Area, promoting efficient land use and energy-efficient design.","status":"PASSED","category":"governance","impact_tags":["zoning amendment","property development","transit-oriented development","North York","land use"],"full_text":"Motion to Adopt Item regarding 250 Ferrand Drive - Zoning By-law Amendment - Decision Report - Approval"},{"id":52,"title":"Approval for Demolition of 128 Rental Units at 7 and 11 Rochefort Drive","summary":"City Council adopted a recommendation to approve the demolition of 128 existing rental dwelling units located at 7 and 11 Rochefort Drive, subject to specific conditions outlined in the application.","status":"ADOPTED","category":"housing","impact_tags":["rental housing","demolition","housing supply","North York","development"],"full_text":"City Council approve the Rental Housing Demolition application File Number 21 239145 NNY 15 RH in accordance with Chapter 667 of the Toronto Municipal Code and pursuant to Section 111 of the City of Toronto Act, 2006 to permit the demolition of 128 existing rental dwelling units located at 7 and 11 Rochefort Drive, subject to the following conditions:"},{"id":53,"title":"Mandatory Provision and Maintenance of 128 Replacement Rental Dwelling Units","summary":"City Council has mandated that a property owner must provide and maintain 128 two-bedroom replacement rental units, totaling at least 8,645 square metres, for a minimum of 20 years. During this period, these units cannot be converted to condominiums or other non-rental uses, nor can they be demolished without replacement.","status":"PASSED","category":"housing","impact_tags":["rental housing","housing development","tenant protection","long-term affordability","city planning"],"full_text":"The owner shall provide and maintain 128 replacement rental dwelling units on the subject site for a period of at least 20 years beginning from the date that each replacement rental dwelling unit is first occupied and, during which time, no application may be submitted to the City for condominium registration, or for any other conversion to a non-rental housing purpose, or for demolition without providing for replacement; b. The replacement rental dwelling units required by Recommendation 1.a. above shall collectively have a total gross floor area of at least 8,645 square metres and be comprised of 128 two-bedroom units, as generally illustrated in the plans submitted to City Planning dated May 26, 2025. Any revision to these plans shall be to the satisfaction of the Chief Planner and Executive Director, City Planning; c. The owner shall, as part of the 128 replacement rental dwelling units required in Recommendation 1."},{"id":54,"title":"Conditions for New Affordable and Mid-Range Rental Units with Tenant Protections","summary":"Council has set conditions for a development, requiring the owner to provide 114 two-bedroom affordable rental units and 14 mid-range rental units for at least 10 years. The owner must also provide a Tenant Assistance Plan for residents of 128 existing units being demolished and ensure tenants of the new replacement units have free access to building amenities.","status":"PASSED","category":"housing","impact_tags":["affordable housing","tenant protection","rental development","housing conditions"],"full_text":"a above, provide at least 114 two-bedroom units replacement rental dwelling units at affordable rents, defined as gross monthly rent no greater than one times the average City of Toronto rent by unit type, as reported annually by the Canada Mortgage and Housing Corporation and 14 two-bedroom units at mid-range rents, defined as gross monthly rent that exceeds Affordable Rent but is no greater than 1.5 times the average City of Toronto rent by unit type, all for a period of at least 10 years beginning from the date of first occupancy of each unit.d. The owner shall provide a Tenant Assistance Plan for tenants of the 128 existing rental dwelling units proposed to be demolished to the satisfaction of the Chief Planner and Executive Director, City Planning;e. The owner shall provide tenants of all 128 replacement rental dwelling units with access to, and use of, all indoor and outdoor amenities in the proposed 30-storey building (Tower C) at no extra charge."},{"id":55,"title":"Development Conditions for Replacement Rental Units and Section 111 Agreement","summary":"City Council approved specific conditions for a development, mandating the provision of bicycle and visitor parking for tenants of replacement rental units, setting a deadline for their occupancy relative to the overall development phases, and requiring the owner to register a Section 111 agreement to legally secure these commitments.","status":"PASSED","category":"housing","impact_tags":["rental housing","development conditions","tenant rights","Section 111 agreement","housing development"],"full_text":"The owner shall provide tenants of all replacement rental dwelling units with access to bicycle and visitor parking on the same terms and conditions as any other resident of the proposed development; i. The replacement rental dwelling units required in Recommendation 1.a. above shall be made ready and available for occupancy no later than the date by which 70 percent of the new dwelling units in the first phase of the proposed development (exclusive of the replacement rental dwelling units) and any units in the second phase of the proposed development are made available and ready for occupancy, subject to any revisions to the satisfaction of the Chief Planner and Executive Director, City Planning; j. The owner shall enter into, and register on title to the lands, an agreement pursuant to Section 111 of the City of Toronto Act, 2006 to secure the conditions outlined in Recommendations 1.a. through 1.i."},{"id":56,"title":"Preliminary Approval for Demolition of 128 Rental Units at 7 and 11 Rochefort Drive","summary":"City Council has authorized the Chief Planner to grant preliminary approval for the demolition of 128 existing rental dwelling units at 7 and 11 Rochefort Drive. This approval is contingent on all prior conditions being secured and relevant zoning by-law amendments being in full effect.","status":"PASSED","category":"housing","impact_tags":["rental housing","demolition","housing development","zoning","Rochefort Drive"],"full_text":"City Council authorize the Chief Planner and Executive Director, City Planning, to issue Preliminary Approval of the Rental Housing Demolition Permit under Chapter 667 of the Toronto Municipal Code pursuant to Section 111 of the City of Toronto Act, 2006 for the demolition of the 128 existing rental dwelling units located at 7 and 11 Rochefort Drive after all the following have occurred: a. All conditions in Recommendation 1 above have been fully secured; b. The Zoning By-law Amendments for application 21 239141 NNY 15 OZ have come into full force and effect; c."},{"id":57,"title":"Approval Conditions and Demolition Permit for Tower C Development","summary":"Council authorizes the issuance of site plan approval conditions, excavation and shoring permits, and a rental housing demolition permit for Tower C, contingent on the owner confirming that all existing rental dwelling units proposed for demolition are vacant.","status":"PASSED","category":"housing","impact_tags":["site plan approval","rental housing","demolition permit","urban development","Tower C"],"full_text":"The issuance of the Notice of Approval Conditions for site plan approval of Tower C by the Executive Director, Development Review or their designate, pursuant to Section 114 of the City of Toronto Act, 2006, or as otherwise determined by the Chief Planner and Executive Director, City Planning; d. The issuance of excavation and shoring permits (conditional or full permit) for the approved development on the site; and e. The owner has confirmed, in writing, that all existing rental dwelling units proposed to be demolished are vacant. 3. City Council authorize the Chief Building Official and Executive Director, Toronto Building to issue a Rental Housing Demolition Permit under Chapter 667 of the Toronto Municipal Code after the Chief Planner and Executive Director, City Planning, or their designate, has given Preliminary Approval referred to in Recommendation 2 above."},{"id":58,"title":"Authorize Residential Demolition Permit for 7 and 11 Rochefort Drive","summary":"City Council is asked to authorize the Chief Building Official to issue a permit for the demolition of residential buildings at 7 and 11 Rochefort Drive. This authorization is conditional on preliminary approval from the Chief Planner and the owner meeting specific conditions, including debris removal and erecting construction hoarding.","status":"UNKNOWN","category":"governance","impact_tags":["residential demolition","building permits","urban planning","city regulations","Rochefort Drive"],"full_text":"City Council authorize the Chief Building Official and Executive Director, Toronto Building to issue a Residential Demolition Permit under Section 33 of the Planning Act and Chapter 363 of the Toronto Municipal Code for 7 and 11 Rochefort Drive after the Chief Planner and Executive Director, City Planning has given Preliminary Approval referred to in Recommendation 2 above, which may be included in the Rental Housing Demolition Permit under Chapter 667 pursuant to section 6.2 of Chapter 363, on condition that: a. The owner removes all debris and rubble from the site immediately after demolition; b. The owner erects solid construction hoarding to the satisfaction of the Chief Building Official and Executive Director, Toronto Building; c."},{"id":59,"title":"Conditions for New Building Construction Timelines and Penalties","summary":"This motion mandates that developers complete Phase 1 buildings (Towers B and C) within three years of demolishing existing rental units, with potential extensions by the Chief Planner. Failure to meet this deadline will result in a $20,000 penalty per dwelling unit, added to property taxes as a lien on the land.","status":"PASSED","category":"housing","impact_tags":["housing development","construction deadlines","developer accountability","financial penalties"],"full_text":"The owner erects the proposed Phase 1 buildings (Towers B and C) on the site no later than three (3) years from the date that the demolition of the existing rental dwelling units commences, subject to the timeframe being extended at the discretion of the Chief Planner and Executive Director, City Planning; and d. Should the owner fail to complete the proposed building within the time specified in Recommendation 4.c. above, the City Clerk shall be entitled to enter on the collector’s roll, as with municipal property taxes, an amount equal to the sum of twenty thousand dollars ($20,000.00) per dwelling unit for which a demolition permit is issued, and that such amount shall, until payment, be a lien or charge upon the land for which the Residential Demolition Permit is issued."},{"id":60,"title":"Approval of Rental Housing Demolition and Replacement at 7 and 11 Rochefort Drive","summary":"City Council approved the demolition of two 4-storey apartment buildings containing 128 rental dwelling units at 7 and 11 Rochefort Drive, with the condition that all 128 rental units will be replaced as part of the new development on the site.","status":"PASSED","category":"housing","impact_tags":["rental housing","housing development","demolition","unit replacement","North York"],"full_text":"City Council authorize the appropriate City officials to take such actions as are necessary to implement City Council's decision, including execution of the Section 111 Agreement and any other related agreements."},{"id":61,"title":"Approval of Official Plan and Zoning By-law Amendments for 22-36 Greenbriar Road Development","summary":"Council approved amendments to the Official Plan and Zoning By-law for the property at 22-36 Greenbriar Road, facilitating a two-phase development that includes new towers (C and B) with rental replacement units, and also approved a residential demolition permit.","status":"PASSED","category":"housing","impact_tags":["zoning amendment","official plan amendment","residential development","rental housing","demolition permit"],"full_text":"NY30.4 - 22-36 Greenbriar Road - Official Plan Amendment and Zoning By-law Amendment Application - Decision Report - Approval"},{"id":62,"title":"City Council amends Official Plan and Zoning for Greenbriar Road development","summary":"City Council voted to amend Official Plan Amendment 650 and Site-Specific Zoning By-law 478-2023 for the property at 22-36 Greenbriar Road, impacting development regulations in Don Valley North.","status":"AMENDED","category":"governance","impact_tags":["Official Plan amendment","Zoning by-law amendment","land use planning","development regulation","Don Valley North"],"full_text":"City Council amend Official Plan Amendment 650 and Site-Specific Zoning By-law 478-2023 for the lands at 22-36 Greenbriar Road."},{"id":63,"title":"Approval of Official Plan and Zoning By-law Amendments for 22-36 Greenbriar Road with Conditions","summary":"City Council approved amendments to the Official Plan and Zoning By-law for the property at 22-36 Greenbriar Road. This approval includes authorizing the City Solicitor to make minor technical changes and requires the applicant to limit their appeal of the Renew Sheppard East Secondary Plan to only this specific site.","status":"PASSED","category":"governance","impact_tags":["urban planning","zoning amendment","official plan","development conditions","land use"],"full_text":"City Council authorizes changes to draft Official Plan and Zoning By-law Amendments and directs applicant to scope appeal."},{"id":64,"title":"Amendment to Zoning By-law for 22-36 Greenbriar Road","summary":"North York Community Council adopted recommendations to amend the Site-Specific Zoning By-law 478-2023 for 22-36 Greenbriar Road, replacing a previous recommendation with a new draft Zoning By-law Amendment. This means the zoning rules for this specific property are being changed.","status":"AMENDED","category":"governance","impact_tags":["zoning amendment","land use planning","Greenbriar Road development","regulatory change"],"full_text":"That North York Community Council adopt the recommendations contained in the supplementary report (February 13, 2026) from the Director, Community Planning, North York District: 1. Delete Recommendation 2 in the report from the Director, Community Planning, North York District titled 22 - 36 Greenbriar Road - Official Plan Amendment and Zoning By-law Amendment - Decision Report - Approval, dated January 29, 2026 and replace with the following: \"City Council amend Site-Specific Zoning By-law 478-2023 for the lands municipally known as 22-36 Greenbriar Road substantially in accordance with the draft Zoning By-law Amendment attached as Attachment 1 to this report\". 2. City Council determine that pursuant to Subsection 34(17) of the Planning Act no further notice is required."},{"id":65,"title":"Council Amends Official Plan Appeal Scope for 22-36 Greenbriar Road","summary":"City Council passed an amendment directing an applicant to limit their appeal of the Renew Sheppard East Secondary Plan (OPA 777) to only the lands at 22-36 Greenbriar Road, affecting an Official Plan and Zoning By-law Amendment.","status":"PASSED","category":"governance","impact_tags":["Urban Planning","Zoning Amendment","Official Plan Appeal","Development Regulation","North York District"],"full_text":"Delete Recommendation 4.a and replace it with the following: 4. City Council direct that before introducing the necessary bills to City Council for enactment, the applicant be required to: a. Scope its appeal of the Renew Sheppard East Secondary Plan (OPA 777) (By-law 1437-2024) geographically to the lands known municipally as 22-36 Greenbriar Road."},{"id":66,"title":"Zoning By-law Amendment Revised: Holding Provision Removed","summary":"A draft Zoning By-law Amendment was revised to remove a 'Holding' provision and related references, as city staff determined they were no longer needed.","status":"AMENDED","category":"governance","impact_tags":["zoning by-law","urban planning","development regulation","city governance"],"full_text":"The revised recommendation allows for the removal of the Holding provision and related references from the draft Zoning By-law Amendment as revised materials have allowed staff to determine they are no longer required."},{"id":67,"title":"North York Community Council Amends Fence Exemption for 37 York Ridge Road","summary":"North York Community Council amended an application for a fence exemption at 37 York Ridge Road.","status":"AMENDED","category":"governance","impact_tags":["fence bylaw","property exemption","North York","community council decision"],"full_text":"NY30.5 - 37 York Ridge Road - Application for Fence Exemption"},{"id":68,"title":"Fence Exemption Granted for 37 York Ridge Road","summary":"North York Community Council granted an exemption for the fence at 37 York Ridge Road, allowing it to exceed standard height and use Juliette-style guards. The decision includes conditions for the enclosure to be maintained and to comply with future by-laws upon replacement.","status":"PASSED","category":"governance","impact_tags":["fence exemption","property by-law","municipal code","North York"],"full_text":"Granted the application for a fence exemption for the property owner of 37 York Ridge Road; directed and required that the enclosure be maintained in good repair without alteration; and at such time as replacement of the enclosure is required that such installation will comply with Municipal Code Chapter 447, Fences, or its successor by-law."},{"id":69,"title":"Fence Exemption Granted for 37 York Ridge Road","summary":"North York Community Council approved a fence exemption for the property at 37 York Ridge Road, with conditions that the fence be maintained and replaced according to city by-laws when necessary.","status":"PASSED","category":"governance","impact_tags":["fence exemption","property standards","municipal by-law","North York","37 York Ridge Road"],"full_text":"Grant the application for a fence exemption for the property owner of 37 York Ridge Road; direct and require that the enclosure be maintained in good repair without alteration; and at such time as replacement of the enclosure is required that such installation will comply with Municipal Code Chapter 447, Fences, or its successor by-law."},{"id":70,"title":"City Council assumes municipal services for Inn on The Park Drive subdivision","summary":"City Council voted to take over responsibility for municipal services, including public highways, within the new Plan of Subdivision 66M-2560 at Inn on The Park Drive, and authorized the release of the developer's performance guarantee.","status":"PASSED","category":"services","impact_tags":["municipal services","subdivision development","infrastructure","North York"],"full_text":"1. City Council assume the municipal services relating to Plan of Subdivision 66M-2560. 2. City Council authorize the Director, Engineering Review, Development Review, to release the performance guarantee held with respect to the municipal services in accordance with the Subdivision Agreement, dated February 6, 2020 between IOTP Development Inc., and the City of Toronto. 3. City Council authorize and direct the City Solicitor to prepare an assumption By-law to assume the public highway within Plan of Subdivision 66M-2560 and to bring it forward for enactment."},{"id":71,"title":"Transfer of Street Lighting System Ownership to Toronto Hydro","summary":"City Council approved the transfer of ownership for the street lighting system in Subdivision 66M-2560 to Toronto Hydro Energy Services Inc.","status":"PASSED","category":"services","impact_tags":["street lighting","infrastructure","Toronto Hydro","subdivision development"],"full_text":"City Council authorize the appropriate City Officials to transfer ownership of the street lighting system constructed within Plan of Subdivision 66M-2560 to Toronto Hydro Energy Services Inc."},{"id":72,"title":"Residential Demolition Approved on Steeles Avenue East and Nipigon Avenue","summary":"North York Community Council approved the demolition of several single-family homes on Steeles Avenue East and Nipigon Avenue, subject to conditions including erecting a construction fence, immediate debris removal, site maintenance with sod, and backfilling holes with clean fill.","status":"AMENDED","category":"housing","impact_tags":["residential demolition","property development","urban planning","site conditions"],"full_text":"1. Approved the applications to demolish the single-family detached houses at 9, 11, 13 and 19 Steeles Avenue East and 8 and 10 Nipigon Avenue with the following conditions: a. That a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. That all debris and rubble be removed immediately after demolition; c. That sod be laid on the site and be maintained free of garbage and weeds, in accordance with the Municipal Code Chapter 629-10, paragraph B and 629-11; and d. That any holes on the property are backfilled with clean fill."},{"id":73,"title":"Approval for Demolition of Six Single-Family Homes in North York","summary":"North York Community Council approved the demolition of six single-family detached houses on Steeles Avenue East and Nipigon Avenue, with conditions for construction fencing and immediate debris removal.","status":"PASSED","category":"housing","impact_tags":["residential demolition","housing development","North York","building permits"],"full_text":"1. Approve the applications to demolish the single-family detached houses at 9, 11, 13 and 19 Steeles Avenue East and 8 and 10 Nipigon Avenue with the following conditions: a. That a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. That all debris and rubble be removed immediately after demolition;"},{"id":74,"title":"Residential Demolition Applications for 41, 43, 45 and 47 Hendon Avenue","summary":"North York Community Council approved the demolition of four single-family homes on Hendon Avenue, subject to conditions including erecting a construction fence, removing debris, maintaining sod, and backfilling holes.","status":"AMENDED","category":"other","impact_tags":["property demolition","residential development","North York","building permits","site maintenance"],"full_text":"Approved the applications to demolish the single-family dwellings at 41, 43, 45 and 47 Hendon Avenue with the following conditions: a. that a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. that all debris and rubble be removed immediately after demolition; c. That sod be laid on the site and be maintained free of garbage and weeds, in accordance with the Municipal Code Chapter 629-10, paragraph B and 629-11; and d. That any holes on the property are backfilled with clean fill."},{"id":75,"title":"Approval of Demolition Applications for Hendon Avenue Properties","summary":"North York Community Council approved the demolition of four single-family homes at 41, 43, 45, and 47 Hendon Avenue, with conditions including the erection of a construction fence and immediate removal of debris.","status":"PASSED","category":"housing","impact_tags":["property demolition","residential development","building permits","city regulations"],"full_text":"Approve the applications to demolish the single-family dwellings at 41, 43, 45 and 47 Hendon Avenue with the following conditions: a. that a construction fence be erected in accordance with the provisions of the Municipal Code, Chapter 363, Article 7, if deemed appropriate by the Chief Building Official; b. that all debris and rubble be removed immediately after demolition;"},{"id":76,"title":"Construction Staging Area Time Extension at 181 Cocksfield Avenue and 824 Sheppard Avenue West","summary":"North York Community Council approved an extension for a construction staging area, allowing the continued closure of a pedestrian sidewalk and a portion of the westbound curb lane on Cocksfield Avenue until May 31, 2026. The decision also requires the applicant to maintain a temporary pedestrian walkway in the area.","status":"PASSED","category":"transportation","impact_tags":["construction","road access","pedestrian safety","North York","temporary closure"],"full_text":"1. Authorized the continuation of the closure of the pedestrian sidewalk and a 3.2 metre wide portion of the westbound curb lane on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and a point 105 metres further east, from March 1, 2026 to May 31, 2026, inclusive. 2. Continued to direct the applicant to install a temporary pedestrian walkway on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":77,"title":"Conditions for Cocksfield Avenue Construction Staging Permit","summary":"Council reaffirmed conditions for a construction staging permit on Cocksfield Avenue, requiring the applicant to maintain a temporary walkway and adjacent areas clear of snow and ice, and provide traffic control for heavy trucks to ensure public safety and efficient traffic flow.","status":"PASSED","category":"services","impact_tags":["construction safety","pedestrian access","snow removal","traffic management","Cocksfield Avenue"],"full_text":"Continued to direct the applicant to clean and maintain the proposed temporary walkway on the south side of Cocksfield Avenue in a condition clear of snow and ice, as required, through the winter months for the entire term of the construction staging area permit. Continued to direct the applicant to ensure that Cocksfield Avenue in the vicinity of the proposed construction staging area, as well as the residential driveways adjacent to the site, are maintained free of snow accumulation and snowbank sight-line obstructions during the winter months for the full term of the construction staging area permit. Continued to direct the applicant to provide designated Traffic Control Persons, at the intersection of Cocksfield Avenue and Goddard Street to escort heavy trucks to the construction staging area, while ensuring the safe and efficient truck movements to eliminate conflicts with general vehicular traffic and pedestrian movements."},{"id":78,"title":"Maintain 'No Stopping' on North Cocksfield Avenue","summary":"Council decided to keep the existing 'no stopping at all times' rule on the north side of Cocksfield Avenue, specifically between 60 and 165 metres east of Wilmington Avenue.","status":"PASSED","category":"transportation","impact_tags":["traffic regulation","parking restriction","Cocksfield Avenue","road safety"],"full_text":"Continued to prohibit stopping at all times on the north side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and a point 105 metres further east."},{"id":79,"title":"Remove 'No Parking Anytime' on South Cocksfield Avenue","summary":"Council voted to remove the current 'no parking anytime' rule on the south side of Cocksfield Avenue, from 60 metres east of Wilmington Avenue to Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["parking regulation","traffic changes","Cocksfield Avenue","parking availability"],"full_text":"Rescinded the existing no parking anytime regulation on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":80,"title":"Maintain 'No Stopping' on South Cocksfield Avenue","summary":"Council decided to keep the existing 'no stopping at all times' rule on the south side of Cocksfield Avenue, from 60 metres east of Wilmington Avenue to Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["traffic regulation","parking restriction","Cocksfield Avenue","road safety"],"full_text":"Continued to prohibit stopping at all times on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street."},{"id":81,"title":"Confirm Removal of One-Way Westbound Traffic on Cocksfield Avenue","summary":"Council confirmed the removal of the existing one-way westbound traffic rule on Cocksfield Avenue, for the section between Wilmington Avenue and 183 metres east of it.","status":"PASSED","category":"transportation","impact_tags":["traffic flow","road designation","Cocksfield Avenue","two-way traffic"],"full_text":"Continued to rescind the existing one-way westbound traffic designation on Cocksfield Avenue, between Wilmington Avenue and a point 183 metres east of Wilmington Avenue."},{"id":82,"title":"Maintain One-Way Westbound Traffic on Cocksfield Avenue","summary":"Council decided to keep Cocksfield Avenue as a one-way westbound street between Wilmington Avenue and Goddard Street.","status":"PASSED","category":"transportation","impact_tags":["traffic flow","road designation","Cocksfield Avenue","one-way street"],"full_text":"Continued to designate Cocksfield Avenue, between Wilmington Avenue and Goddard Street as a one-way westbound traffic only."},{"id":83,"title":"Applicant cooperation for municipal infrastructure work","summary":"The applicant is directed to fully cooperate with City Engineers and staff for municipal infrastructure operations, maintenance, and construction near their staging area, including removing staging if needed, at no cost to the City.","status":"PASSED","category":"services","impact_tags":["municipal infrastructure","construction","city services","applicant responsibility"],"full_text":"Continued to direct the applicant to cooperate with and provide all necessary assistance to the City Engineers, staff and representatives carrying out operation, maintenance, and construction activities to municipal infrastructure within the vicinity of the construction staging area, and at no cost to the City to remove any staging to accommodate the necessary municipal infrastructure work."},{"id":84,"title":"Restoration of Cocksfield Avenue traffic and parking","summary":"Cocksfield Avenue will have its original traffic and parking rules reinstated once the current project is finished, with updated parking rates and hours.","status":"PASSED","category":"transportation","impact_tags":["traffic regulations","parking","road restoration","Cocksfield Avenue","post-construction"],"full_text":"Directed that Cocksfield Avenue be returned to its pre-construction traffic and parking regulations (except with parking rates and hours of operation being consistent to the rates and hours of operation at the time of completion) when the project is complete."},{"id":85,"title":"Council authorizes temporary road and sidewalk closure on Cocksfield Avenue","summary":"City Council approved a temporary closure of a pedestrian sidewalk and a portion of the westbound lane on Cocksfield Avenue from November 2025 to January 2026. This closure is to allow for staging operations related to the underground garage construction of a new residential building.","status":"PASSED","category":"transportation","impact_tags":["road closure","sidewalk closure","construction impact","traffic disruption","pedestrian access"],"full_text":"City Council at its meeting on October 8 and 9, 2025, adopted item - 2025.NY26.18 and in so doing authorized a closure of the pedestrian sidewalk and a 3.2 metre wide portion of the westbound lane on the south side of Cocksfield Avenue, between a point 60 metres east of Wilmington Avenue and Goddard Street, from November 1, 2025 to January 31, 2026, to facilitate staging operations for the underground garage construction."},{"id":86,"title":"North York Community Council approves speed humps on Dalemount Avenue","summary":"North York Community Council authorized the installation of three speed humps on Dalemount Avenue, between Madoc Drive and Shelborne Avenue, to calm traffic and improve road safety.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","neighbourhood improvement"],"full_text":"NY30.10 - Dalemount Avenue - Traffic Calming (Speed Humps)"},{"id":87,"title":"Speed Humps Approved for Ranleigh Avenue","summary":"City Council adopted the recommendation to install speed humps on Ranleigh Avenue to improve traffic safety and reduce vehicle speeds.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","road safety","speed reduction","Ranleigh Avenue"],"full_text":"NY30.11 - Ranleigh Avenue - Traffic Calming (Speed Humps)"},{"id":88,"title":"Installation of speed humps on Ranleigh Avenue","summary":"North York Community Council approved the installation of two speed humps on Ranleigh Avenue, between Mount Pleasant Road and Ronan Avenue, to calm traffic and improve road safety.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","North York"],"full_text":"1. Authorized the installation of traffic calming (2 speed humps) on Ranleigh Avenue, between Mount Pleasant Road and Ronan Avenue, generally as shown in Attachment 2 to the report (January 30, 2026) from the Director, Enforcement and Street Management Transportation Services, Drawing Number TC-641, dated January 2026."},{"id":89,"title":"20 O’Neill Road - Designation of Fire Routes and Amendment to Chapter 880 - Fire Routes","summary":"North York Community Council designated parts of the private road at 20 O'Neill Road as a fire route, authorizing the Fire Chief and City Solicitor to implement this change to improve emergency access and safety.","status":"PASSED","category":"services","impact_tags":["fire safety","emergency access","city bylaw","20 O'Neill Road"],"full_text":"1. Designated that part or those parts of the private road or roads shown on the site plans filed with the Fire Chief in respect of the municipal address set out below, as a fire route pursuant to Municipal Code Chapter 880 - Fire Routes - 20 O’Neill Road. 2. Authorized the Fire Chief and City Solicitor to take the appropriate action to make a designated Fire Route."},{"id":90,"title":"North York Community Council Approves Fire Route Designation","summary":"North York Community Council approved an amendment to the Fire Route By-law, designating specific locations at 20 O'Neill Road as fire routes to enhance fire prevention and protection services.","status":"PASSED","category":"services","impact_tags":["fire safety","emergency services","by-law amendment","North York","public safety"],"full_text":"Designation of Fire Routes at 20 O'Neill Road"},{"id":91,"title":"Traffic Calming and Speed Limit Reduction on Moatfield Drive","summary":"North York Community Council approved the installation of seven speed humps and reduced the speed limit from 40 km/h to 30 km/h on Moatfield Drive to improve traffic safety.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","speed limit reduction","road safety","neighbourhood improvement"],"full_text":"1. Authorized the installation of traffic calming (7 speed humps) on Moatfield Drive, between Valleybrook Drive and Don Mills Road, generally as shown in Attachments 2 to 4 to the report (January 30, 2026) from the Director, Enforcement and Street Management Transportation Services, Drawing Number TC-647, TC-647-1 and TC-647-2, dated January 2026. 2. Subject to approval of Part 1 above, reduced the speed limit from 40 kilometres per hour to 30 kilometres per hour on Moatfield Drive, between Valleybrook Drive and Don Mills Road, in conjunction with the installation of speed humps."},{"id":92,"title":"Speed Humps Approved for Moatfield Drive","summary":"Council approved the installation of speed humps on Moatfield Drive, between Valleybrook Drive and Don Mills Road, to calm traffic and improve safety, based on a staff recommendation.","status":"PASSED","category":"transportation","impact_tags":["traffic calming","speed humps","road safety","Moatfield Drive"],"full_text":"Motion to Adopt Item moved by Councillor Jon Burnside (Carried) regarding the installation of speed humps on Moatfield Drive, between Valleybrook Drive and Don Mills Road."},{"id":93,"title":"Weekday Parking Restrictions on Dallimore Circle for Community Bus Stop","summary":"City Council adopted a motion to prohibit standing on the southside of Dallimore Circle, Monday to Friday, to accommodate a new community bus stop. This amends previous all-day 'no stopping' restrictions, limiting them to weekdays to address resident concerns about parking availability.","status":"PASSED","category":"transportation","impact_tags":["parking restrictions","community bus","traffic management","Dallimore Circle"],"full_text":"City Council prohibit standing, Monday to Friday, on the southside of Dallimore Circle, between a point 93 metres southwest of Haldenby Terrace (east intersection) and a point 21 metres further southwest."},{"id":94,"title":"Weekend Parking Allowed at 120 Dallimore Circle","summary":"City Council approved a change to parking rules at 120 Dallimore Circle, allowing visitors to park for up to three hours on weekends. This change was made because the community bus stop is only used Monday to Friday, freeing up space on weekends.","status":"PASSED","category":"transportation","impact_tags":["parking regulations","local transportation","community access"],"full_text":"Motion to Adopt Item regarding changes to parking provisions at 120 Dallimore Circle"},{"id":95,"title":"Lowering Speed Limits in Parkwoods and Don Mills Neighbourhoods","summary":"City Council adopted a motion to lower speed limits in the Parkwoods and Don Mills neighbourhoods to improve road safety for residents.","status":"ADOPTED","category":"transportation","impact_tags":["speed limits","road safety","neighbourhoods"],"full_text":"NY30.15 - Parkwoods and Don Mills Neighbourhoods - Lowering Speed Limits"},{"id":96,"title":"North York Community Council Reduces Speed Limits in Don Valley East","summary":"The North York Community Council approved a reduction in speed limits from 50 km/h to 40 km/h on several residential streets in the Don Valley East area to enhance road safety.","status":"PASSED","category":"transportation","impact_tags":["speed limits","road safety","traffic calming","Don Valley East","community safety"],"full_text":"Reduced the speed limit from 50 kilometres per hour to 40 kilometres per hour on the following roads: a. Bushbury Drive, between Laurentide Drive and the west end of Bushbury Drive; b. Parmbelle Crescent, between Bushbury Drive and Laurentide Drive; c. Sandpiper Court, between Laurentide Drive and the south end of Sandpiper Court; d. Tetbury Crescent, between Laurentide Drive and Sandpiper Court; e. Spinney Court, between Laurentide Drive and the north end of Spinney Court; f. Barnwood Court, between Laurentide Drive and the south end of Barnwood Court; g. Alvarado Place, between Laurentide Drive and the north end of Alvarado Place; h. Larabee Crescent, between Laurentide Drive and the north end of Larabee Crescent; i. Groveland Crescent, between Three Valleys Drive (west intersection) and Three Valleys Drive (east intersection); j."},{"id":97,"title":"Upjohn Road Parking Prohibition Amended","summary":"The North York Community Council adjusted the 'no parking at all times' rule on the east side of Upjohn Road. The restricted section now runs from York Mills Road to Dyas Road, shortening the previous prohibited area.","status":"PASSED","category":"transportation","impact_tags":["parking rules","Upjohn Road","traffic changes","local residents"],"full_text":"North York Community Council amends parking prohibition on Upjohn Road"},{"id":98,"title":"Dunblaine Avenue Parking Regulation Changes Adopted","summary":"North York Community Council approved changes to the one-hour parking regulations on the north side of Dunblaine Avenue, west of Avenue Road, adjusting the specific section where the restriction applies.","status":"PASSED","category":"transportation","impact_tags":["parking regulations","Dunblaine Avenue","North York","traffic management"],"full_text":"NY30.17 - Dunblaine Avenue, West of Avenue Road - Parking Regulation Changes"},{"id":99,"title":"Dunblaine Avenue Parking Regulation Changes","summary":"Council approved minor parking regulation changes on Dunblaine Avenue, west of Avenue Road, to support local businesses and the Upper Avenue BIA. This includes prohibiting stopping in one section and authorizing 15-minute parking in another.","status":"PASSED","category":"transportation","impact_tags":["parking regulations","Dunblaine Avenue","local businesses","traffic management","BIA support"],"full_text":"Prohibited stopping at all times on the north side of Dunblaine Avenue, between Avenue Road and a point 17 metres west. Authorized parking for a maximum period of 15 minutes from 8:30 a.m. to 6:00 p.m., daily, on the north side of Dunblaine Avenue, between a point 17 metres west of Avenue Road and a point 19 metres further west."}]}
